; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
  (:predicates
    (clear ?x)
    (on-table ?x)
    (arm-empty)
    (holding ?x)
    (on ?x ?y)
  )

  (:action pickup
    :parameters (?ob)
    :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
    :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
      (not (arm-empty)))
  )

  (:action putdown
    :parameters (?ob)
    :precondition (holding ?ob)
    :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
      (not (holding ?ob)))
  )

  (:action stack
    :parameters (?ob ?underob)
    :precondition (and (clear ?underob) (holding ?ob))
    :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
      (not (clear ?underob)) (not (holding ?ob)))
  )

  (:action unstack
    :parameters (?ob ?underob)
    :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
    :effect (and (holding ?ob) (clear ?underob)
      (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))
  )
)

; problem
(define (problem BW-rand-25)
(:domain blocksworld-4ops)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 )
(:init
(arm-empty)
(on-table b1)
(on-table b2)
(on b3 b9)
(on b4 b7)
(on-table b5)
(on b6 b15)
(on-table b7)
(on-table b8)
(on b9 b6)
(on b10 b18)
(on b11 b5)
(on b12 b17)
(on b13 b1)
(on b14 b16)
(on-table b15)
(on b16 b23)
(on b17 b3)
(on b18 b22)
(on b19 b20)
(on b20 b24)
(on b21 b8)
(on b22 b25)
(on-table b23)
(on b24 b11)
(on b25 b14)
(clear b2)
(clear b4)
(clear b10)
(clear b12)
(clear b13)
(clear b19)
(clear b21)
)
(:goal
(and
(on b1 b3)
(on b2 b20)
(on b3 b8)
(on b4 b1)
(on b5 b24)
(on b6 b14)
(on b7 b18)
(on b8 b7)
(on b9 b11)
(on b13 b5)
(on b14 b2)
(on b15 b17)
(on b17 b23)
(on b18 b6)
(on b19 b25)
(on b21 b16)
(on b22 b15)
(on b23 b19)
(on b24 b22)
(on b25 b9))
)
)

; plan
1. (unstack b13 b1)
   deleted: (on b13 b1) (clear b13) (arm-empty)
   added: (holding b13) (clear b1)
   goals met: 0 of 20
2. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 20
3. (unstack b19 b20)
   deleted: (on b19 b20) (clear b19) (arm-empty)
   added: (holding b19) (clear b20)
   goals met: 0 of 20
4. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 20
5. (unstack b20 b24)
   deleted: (on b20 b24) (clear b20) (arm-empty)
   added: (holding b20) (clear b24)
   goals met: 0 of 20
6. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 0 of 20
7. (unstack b24 b11)
   deleted: (on b24 b11) (clear b24) (arm-empty)
   added: (holding b24) (clear b11)
   goals met: 0 of 20
8. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 0 of 20
9. (unstack b11 b5)
   deleted: (on b11 b5) (clear b11) (arm-empty)
   added: (holding b11) (clear b5)
   goals met: 0 of 20
10. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 20
11. (unstack b4 b7)
   deleted: (on b4 b7) (clear b4) (arm-empty)
   added: (holding b4) (clear b7)
   goals met: 0 of 20
12. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 20
13. (unstack b21 b8)
   deleted: (on b21 b8) (clear b21) (arm-empty)
   added: (holding b21) (clear b8)
   goals met: 0 of 20
14. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 0 of 20
15. (unstack b12 b17)
   deleted: (on b12 b17) (clear b12) (arm-empty)
   added: (holding b12) (clear b17)
   goals met: 0 of 20
16. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 20
17. (unstack b17 b3)
   deleted: (on b17 b3) (clear b17) (arm-empty)
   added: (holding b17) (clear b3)
   goals met: 0 of 20
18. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 20
19. (unstack b3 b9)
   deleted: (on b3 b9) (clear b3) (arm-empty)
   added: (holding b3) (clear b9)
   goals met: 0 of 20
20. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 20
21. (unstack b9 b6)
   deleted: (on b9 b6) (clear b9) (arm-empty)
   added: (holding b9) (clear b6)
   goals met: 0 of 20
22. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 20
23. (unstack b6 b15)
   deleted: (on b6 b15) (clear b6) (arm-empty)
   added: (holding b6) (clear b15)
   goals met: 0 of 20
24. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 20
25. (unstack b10 b18)
   deleted: (on b10 b18) (clear b10) (arm-empty)
   added: (holding b10) (clear b18)
   goals met: 0 of 20
26. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 0 of 20
27. (unstack b18 b22)
   deleted: (on b18 b22) (clear b18) (arm-empty)
   added: (holding b18) (clear b22)
   goals met: 0 of 20
28. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 20
29. (unstack b22 b25)
   deleted: (on b22 b25) (clear b22) (arm-empty)
   added: (holding b22) (clear b25)
   goals met: 0 of 20
30. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 20
31. (unstack b25 b14)
   deleted: (on b25 b14) (clear b25) (arm-empty)
   added: (holding b25) (clear b14)
   goals met: 0 of 20
32. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 0 of 20
33. (unstack b14 b16)
   deleted: (on b14 b16) (clear b14) (arm-empty)
   added: (holding b14) (clear b16)
   goals met: 0 of 20
34. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 0 of 20
35. (unstack b16 b23)
   deleted: (on b16 b23) (clear b16) (arm-empty)
   added: (holding b16) (clear b23)
   goals met: 0 of 20
36. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 0 of 20
37. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 0 of 20
38. (stack b2 b20)
   deleted: (clear b20) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b20)
   goals met: 1 of 20
39. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 1 of 20
40. (stack b14 b2)
   deleted: (clear b2) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b2)
   goals met: 2 of 20
41. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 2 of 20
42. (stack b6 b14)
   deleted: (clear b14) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b14)
   goals met: 3 of 20
43. (pickup b18)
   deleted: (clear b18) (on-table b18) (arm-empty)
   added: (holding b18)
   goals met: 3 of 20
44. (stack b18 b6)
   deleted: (clear b6) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b6)
   goals met: 4 of 20
45. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 4 of 20
46. (stack b7 b18)
   deleted: (clear b18) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b18)
   goals met: 5 of 20
47. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 5 of 20
48. (stack b8 b7)
   deleted: (clear b7) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b7)
   goals met: 6 of 20
49. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 6 of 20
50. (stack b3 b8)
   deleted: (clear b8) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b8)
   goals met: 7 of 20
51. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 7 of 20
52. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 8 of 20
53. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 8 of 20
54. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 9 of 20
55. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 9 of 20
56. (stack b9 b11)
   deleted: (clear b11) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b11)
   goals met: 10 of 20
57. (pickup b25)
   deleted: (clear b25) (on-table b25) (arm-empty)
   added: (holding b25)
   goals met: 10 of 20
58. (stack b25 b9)
   deleted: (clear b9) (holding b25)
   added: (arm-empty) (clear b25) (on b25 b9)
   goals met: 11 of 20
59. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 11 of 20
60. (stack b19 b25)
   deleted: (clear b25) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b25)
   goals met: 12 of 20
61. (pickup b23)
   deleted: (clear b23) (on-table b23) (arm-empty)
   added: (holding b23)
   goals met: 12 of 20
62. (stack b23 b19)
   deleted: (clear b19) (holding b23)
   added: (arm-empty) (clear b23) (on b23 b19)
   goals met: 13 of 20
63. (pickup b17)
   deleted: (clear b17) (on-table b17) (arm-empty)
   added: (holding b17)
   goals met: 13 of 20
64. (stack b17 b23)
   deleted: (clear b23) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b23)
   goals met: 14 of 20
65. (pickup b15)
   deleted: (clear b15) (on-table b15) (arm-empty)
   added: (holding b15)
   goals met: 14 of 20
66. (stack b15 b17)
   deleted: (clear b17) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b17)
   goals met: 15 of 20
67. (pickup b22)
   deleted: (clear b22) (on-table b22) (arm-empty)
   added: (holding b22)
   goals met: 15 of 20
68. (stack b22 b15)
   deleted: (clear b15) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b15)
   goals met: 16 of 20
69. (pickup b24)
   deleted: (clear b24) (on-table b24) (arm-empty)
   added: (holding b24)
   goals met: 16 of 20
70. (stack b24 b22)
   deleted: (clear b22) (holding b24)
   added: (arm-empty) (clear b24) (on b24 b22)
   goals met: 17 of 20
71. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 17 of 20
72. (stack b5 b24)
   deleted: (clear b24) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b24)
   goals met: 18 of 20
73. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 18 of 20
74. (stack b13 b5)
   deleted: (clear b5) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b5)
   goals met: 19 of 20
75. (pickup b21)
   deleted: (clear b21) (on-table b21) (arm-empty)
   added: (holding b21)
   goals met: 19 of 20
76. (stack b21 b16)
   deleted: (clear b16) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b16)
   goals met: 20 of 20
